Revit 2027 API
MEPSection.VelocityPressure Property
 The velocity pressure of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VelocityPressure { get; }
Public ReadOnly Property VelocityPressure As Double
	Get
public:
property double VelocityPressure {
	double get ();
}
member VelocityPressure : float with get
Property Value
Double
Remarks
 Default unit is Kgf per square feet. For Duct, unit type is UT_HVAC_Pressure. For Pipe, unit type is UT_Piping_Pressure
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace